Revit 2027 API
BuiltInFailures.RefPlaneFailures Class
 Failures about RefPlane.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RefPlaneFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RefPlaneFailures
Public NotInheritable Class RefPlaneFailures
public ref class RefPlaneFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RefPlaneFailures = class end
The BuiltInFailures.RefPlaneFailures type exposes the following members.
Properties
Name | Description
AlreadyHaveTwoClosurePlanes |  No more than two closure planes are allowed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace